In [1]:
from array import array

In [2]:
x = array('i', [1,2,3,4])

In [3]:
x

array('i', [1, 2, 3, 4])

In [4]:
x.append(5)

In [6]:
x.append("a")

TypeError: an integer is required (got type str)

In [7]:
import numpy as np

In [8]:
a = np.array([1, 2, 3, 4, 5])

In [9]:
a

array([1, 2, 3, 4, 5])

In [10]:
a.dtype

dtype('int64')

In [19]:
a = np.array([1.2, 2, 3, -1])

In [20]:
a.dtype

dtype('float64')

In [21]:
a = np.arange(10)

In [22]:
a

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [23]:

a = np.random.random((10))

In [24]:
a

array([0.61787849, 0.62291549, 0.40255482, 0.30721217, 0.15287535,
       0.43756028, 0.97758113, 0.56329337, 0.84454945, 0.94178605])

In [25]:
a.shape

(10,)

In [26]:
a = np.random.random(20).reshape(4, 5)

In [27]:
a

array([[0.88089846, 0.66686773, 0.61783853, 0.04745132, 0.70991001],
       [0.80334127, 0.81642877, 0.52972047, 0.47707301, 0.96443079],
       [0.25126962, 0.80592982, 0.31013779, 0.54942082, 0.79772483],
       [0.24604419, 0.41707334, 0.84096241, 0.96473123, 0.85182688]])

In [28]:
b = np.random.random([4, 5])

In [29]:
b

array([[0.10655261, 0.44105271, 0.55505246, 0.00353952, 0.52462276],
       [0.54854623, 0.23192845, 0.27203441, 0.6791482 , 0.23385682],
       [0.02501516, 0.33361344, 0.63934721, 0.74005347, 0.67148988],
       [0.62045344, 0.28560132, 0.35918767, 0.47538411, 0.1843331 ]])

In [31]:
np.zeros((4, 5))

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [32]:
np.zeros(20).reshape(4, 5)

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [33]:
np.eye((4))

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [34]:
np.eye(4, 5)

array([[1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.]])

In [44]:
a = np.random.randint(10, size=(2,3, 4))

In [45]:
a

array([[[2, 7, 6, 9],
        [2, 5, 2, 5],
        [1, 3, 2, 3]],

       [[5, 0, 3, 8],
        [7, 6, 0, 6],
        [6, 5, 9, 3]]])

In [46]:
a.shape

(2, 3, 4)

In [47]:
a.ndim

3

In [48]:
a.dtype

dtype('int64')

In [49]:
a.strides

(96, 32, 8)

In [50]:
c_array = np.random.rand(1000,1000)

In [53]:
c_array.flags

  C_CONTIGUOUS : True
  F_CONTIGUOUS : False
  OWNDATA : True
  WRITEABLE : True
  ALIGNED : True
  WRITEBACKIFCOPY : False
  UPDATEIFCOPY : False

In [54]:
f_array = np.asfortranarray(c_array)

In [56]:
f_array.flags

  C_CONTIGUOUS : False
  F_CONTIGUOUS : True
  OWNDATA : True
  WRITEABLE : True
  ALIGNED : True
  WRITEBACKIFCOPY : False
  UPDATEIFCOPY : False

In [57]:
a = np.random.randint(10, size=(3,4))

In [58]:
a

array([[6, 2, 0, 1],
       [0, 6, 0, 1],
       [7, 9, 3, 1]])

In [61]:
b = a[:,2:]

In [62]:
b

array([[0, 1],
       [0, 1],
       [3, 1]])

In [63]:
b

array([[0, 1],
       [0, 1],
       [3, 1]])

In [64]:
b[0][1] = 5

In [65]:
b

array([[0, 5],
       [0, 1],
       [3, 1]])

In [66]:
a

array([[6, 2, 0, 5],
       [0, 6, 0, 1],
       [7, 9, 3, 1]])

In [67]:
np.may_share_memory(a, b)

True

In [70]:
c = np.empty((3, 4))

In [71]:
c

array([[0.00000000e+000, 1.48219694e-323, 0.00000000e+000,
        0.00000000e+000],
       [0.00000000e+000, 3.76231868e+174, 4.96203532e-090,
        1.08533659e-042],
       [2.36588395e+179, 6.18310784e+169, 6.99196248e+228,
        1.46016161e-319]])

In [72]:
c[:] = a

In [73]:
c

array([[6., 2., 0., 5.],
       [0., 6., 0., 1.],
       [7., 9., 3., 1.]])

In [74]:
np.may_share_memory(c, a)

False

In [75]:
np.full(15, 5).reshape(3, 5)

array([[5, 5, 5, 5, 5],
       [5, 5, 5, 5, 5],
       [5, 5, 5, 5, 5]])

In [1]:
pip install pandas

Requirement already satisfied: pandas in /Users/mehdihatamigoloujeh/opt/anaconda3/lib/python3.9/site-packages (1.3.4)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/mehdihatamigoloujeh/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in /Users/mehdihatamigoloujeh/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in /Users/mehdihatamigoloujeh/opt/anaconda3/lib/python3.9/site-packages (from pandas) (1.20.3)
Requirement already satisfied: six>=1.5 in /Users/mehdihatamigoloujeh/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [3]:
np.array([1, 2, 3])

array([1, 2, 3])

In [4]:
a = arange(10)

NameError: name 'arange' is not defined

In [4]:
a = np.arange(10)

In [5]:
a

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [6]:
pd.Series([a, b, c, d, e])

NameError: name 'b' is not defined

In [7]:
pd.series([1,2,3])

AttributeError: module 'pandas' has no attribute 'series'

In [51]:
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

In [52]:
pd.Series(['a', 'b', 'c'])

0    a
1    b
2    c
dtype: object

In [53]:
s = pd.Series(np.random.randint(10, size=10))

In [54]:
s

0    7
1    4
2    7
3    4
4    6
5    9
6    3
7    0
8    1
9    2
dtype: int64

In [55]:
pd.Series(np.arange(15))

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
dtype: int64

In [56]:
pd.Series(np.random.rand(10), name="Serie1", index=np.arange(10, 20))

10    0.235873
11    0.123111
12    0.503978
13    0.610686
14    0.588628
15    0.455142
16    0.241028
17    0.432265
18    0.550814
19    0.560038
Name: Serie1, dtype: float64

In [57]:
df = pd.DataFrame(np.random.rand(22, 5))

In [58]:
df1 = pd.DataFrame(np.random.rand(20, 5), index = np.arange(100, 120), columns=['c1', 'c2', 'c3', 'c4', 'c5'])

In [59]:
df1

           c1        c2        c3        c4        c5
100  0.757025  0.140231  0.618503  0.501026  0.455155
101  0.970811  0.112539  0.357791  0.576003  0.906319
102  0.653631  0.137783  0.656106  0.523488  0.890830
103  0.084739  0.222528  0.102514  0.968684  0.472687
104  0.615610  0.845774  0.226176  0.021822  0.170438
105  0.989209  0.793201  0.300417  0.251949  0.350366
106  0.986513  0.863326  0.826637  0.727192  0.351688
107  0.483441  0.516224  0.787471  0.381928  0.792153
108  0.833252  0.751680  0.844038  0.840903  0.747044
109  0.020687  0.981593  0.706103  0.823974  0.872666
110  0.518371  0.761498  0.150914  0.617168  0.343283
111  0.235565  0.995800  0.422369  0.888583  0.001984
112  0.801084  0.237480  0.572694  0.332989  0.866533
113  0.616469  0.680175  0.265366  0.464805  0.768323
114  0.140473  0.351765  0.003803  0.179896  0.360741
115  0.669178  0.507931  0.444019  0.880255  0.193355
116  0.207809  0.432306  0.948440  0.991336  0.177206
117  0.665748  0.340246  0.146982  0.146534  0.758632
118  0.559292  0.194073  0.208737  0.989662  0.224124
119  0.609490  0.152455  0.187020  0.457998  0.305450

In [27]:
from faker import Faker

In [29]:
fake = Faker('fa')

In [31]:
fake.name()

'علی رضا صیادی'

In [45]:
my_dic = {
    'age':np.random.randint(80, 100, 100),
    'name':[fake.name() for i in range(100)],
}

In [46]:
df = pd.DataFrame(my_dic)

In [47]:
df.index

RangeIndex(start=0, stop=100, step=1)

In [48]:
df.head()

   age                         name
0   86      سرکار خانم مبينا بهرامی
1   96  سرکار خانم دکتر محدثه کمالی
2   98  سرکار خانم دکتر فاطمه شاکری
3   99                   محمد هاشمی
4   93                    رضا پویان

In [49]:
df

    age                          name
0    86       سرکار خانم مبينا بهرامی
1    96   سرکار خانم دکتر محدثه کمالی
2    98   سرکار خانم دکتر فاطمه شاکری
3    99                    محمد هاشمی
4    93                     رضا پویان
..  ...                           ...
95   80                  الينا مهدیان
96   89                   ايليا بهمنی
97   82  جناب آقای محمدپارسا جعفر پور
98   94                 نازنين مجتبوی
99   87                  عرفان شمشیری

[100 rows x 2 columns]

NameError: name 'mm' is not defined

In [35]:
mmm = mm.reset_index()

In [36]:
mmm

    level_0  index  newseries
0         0    0.0   0.832842
1         1    2.5   0.125533
2         2    5.0   0.421146
3         3    7.5   0.692569
4         4   10.0   0.578336
5         5   12.5   0.496820
6         6   15.0   0.274772
7         7   17.5   0.870582
8         8   20.0   0.247071
9         9   22.5   0.588012
10       10   25.0   0.720454
11       11   27.5   0.255954

In [1]:
import numpy as np
import pandas as pd

In [13]:
a = pd.DataFrame(np.random.randint(10, size=(10, 3)), index=range(10,20), columns=['age', 'name', 'sex'])

In [14]:
a

    age  name  sex
10    7     1    1
11    0     1    1
12    6     8    0
13    1     8    5
14    4     2    7
15    3     9    1
16    2     2    1
17    1     0    1
18    7     8    5
19    9     7    1

In [15]:
pd.DataFrame([[1, 2, 3, 4],[5, 6, 7, 8]])

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [16]:
pip install faker

Collecting faker
  Downloading Faker-14.2.0-py3-none-any.whl (1.6 MB)
     |████████████████████████████████| 1.6 MB 5.0 MB/s eta 0:00:01
Requirement already satisfied: python-dateutil>=2.4 in /Users/mehdihatamigoloujeh/opt/anaconda3/lib/python3.9/site-packages (from faker) (2.8.2)
Requirement already satisfied: six>=1.5 in /Users/mehdihatamigoloujeh/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.4->faker) (1.16.0)
Installing collected packages: faker
Successfully installed faker-14.2.0
Note: you may need to restart the kernel to use updated packages.

In [17]:
fake.name()

NameError: name 'fake' is not defined

In [18]:
from faker import Faker

In [19]:
fake = Faker()

In [30]:
fake.name()

'Christopher Greer'

In [31]:
d = {
    'age' : pd.Series(np.random.randint(0,80, 25)),
    
    'name': pd.Series([fake.name() for i in range(25)])
}

In [32]:
d

{'age': 0      5
 1     31
 2      2
 3      4
 4     42
 5     30
 6     36
 7     52
 8     45
 9     38
 10    24
 11     2
 12    68
 13    24
 14    45
 15    70
 16    15
 17    67
 18     5
 19    47
 20    73
 21    29
 22    61
 23    63
 24    24
 dtype: int64,
 'name': 0         Michael Prince
 1             Wayne Cruz
 2          Crystal Henry
 3            Steven Hall
 4             Tracy Meza
 5        Richard Proctor
 6         Laurie Acevedo
 7            Holly Wells
 8          Michael Brown
 9             Denise Day
 10    Christopher Norris
 11     Jeremiah Martinez
 12          Brian Miller
 13        Arthur Shelton
 14     Gabrielle Wilkins
 15           Tina Fowler
 16             Luis Hill
 17         Lindsay Evans
 18            Ian Morris
 19          Denise Woods
 20     Darrell Gutierrez
 21             Robin Cox
 22          Derek Chavez
 23            Paula Reed
 24           Lori Curtis
 dtype: object}

In [33]:
pd.DataFrame(d)

    age                name
0     5      Michael Prince
1    31          Wayne Cruz
2     2       Crystal Henry
3     4         Steven Hall
4    42          Tracy Meza
5    30     Richard Proctor
6    36      Laurie Acevedo
7    52         Holly Wells
8    45       Michael Brown
9    38          Denise Day
10   24  Christopher Norris
11    2   Jeremiah Martinez
12   68        Brian Miller
13   24      Arthur Shelton
14   45   Gabrielle Wilkins
15   70         Tina Fowler
16   15           Luis Hill
17   67       Lindsay Evans
18    5          Ian Morris
19   47        Denise Woods
20   73   Darrell Gutierrez
21   29           Robin Cox
22   61        Derek Chavez
23   63          Paula Reed
24   24         Lori Curtis

In [34]:
a = np.array(range(10))

In [35]:
a

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [36]:
s = pd.Series(a)

In [37]:
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [38]:
a = np.array(range(10))

In [39]:
a

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [40]:
b = np.arange(10)

In [41]:
b

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [42]:
a == b

array([ True,  True,  True,  True,  True,  True,  True,  True,  True,
        True])

In [43]:
a is b

False

In [1]:
print("hello world!")

hello world!

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
pd.DataFrame(np.random.rand(3, 4))

          0         1         2         3
0  0.150649  0.192583  0.657407  0.664315
1  0.745186  0.336625  0.461662  0.713082
2  0.352675  0.380781  0.813272  0.965916

In [11]:
a = pd.DataFrame(np.random.randint(10, size=(10, 15)))

In [12]:
a

   0   1   2   3   4   5   6   7   8   9   10  11  12  13  14
0   1   2   2   4   9   8   2   8   8   2   1   2   4   1   3
1   8   6   0   4   0   5   8   2   5   6   2   0   7   5   7
2   9   7   8   8   0   8   1   9   6   9   1   4   9   5   8
3   8   7   9   7   2   2   4   4   2   5   8   5   0   1   1
4   3   7   0   0   9   0   7   5   1   8   4   6   1   8   9
5   2   3   6   0   4   7   9   7   7   6   1   7   9   7   2
6   0   8   7   8   5   6   5   3   3   0   8   4   3   4   4
7   9   4   0   2   6   5   5   3   7   0   7   6   7   1   1
8   2   6   0   2   8   4   3   8   9   0   2   8   3   9   2
9   6   0   2   3   5   7   7   2   6   3   1   2   4   7   9

In [15]:
a[0][2]

9

In [22]:
b = pd.DataFrame(np.random.rand(4, 4), index = ('a', 'b', 'c', 'd'), columns = (11, 12, 13, 14))

In [23]:
b

         11        12        13        14
a  0.972423  0.235304  0.736969  0.324379
b  0.464763  0.643851  0.877720  0.011600
c  0.328165  0.081616  0.490848  0.206590
d  0.086345  0.982649  0.986055  0.139848

In [26]:
d = {
    'age':pd.Series(np.random.randint(0, 85, 20)),
    'id' :pd.Series(np.random.rand(20))
}

In [27]:
d

{'age': 0     36
 1     64
 2     31
 3     79
 4     73
 5     56
 6     78
 7      8
 8     56
 9     81
 10    32
 11    75
 12    31
 13    73
 14    20
 15    47
 16    50
 17    53
 18    62
 19    74
 dtype: int64,
 'id': 0     0.546437
 1     0.069717
 2     0.704366
 3     0.495795
 4     0.402426
 5     0.941047
 6     0.872216
 7     0.536620
 8     0.253029
 9     0.298577
 10    0.431191
 11    0.908531
 12    0.619660
 13    0.481040
 14    0.029053
 15    0.068355
 16    0.324246
 17    0.369011
 18    0.172744
 19    0.687350
 dtype: float64}

In [28]:
pd.DataFrame(d)

    age        id
0    36  0.546437
1    64  0.069717
2    31  0.704366
3    79  0.495795
4    73  0.402426
5    56  0.941047
6    78  0.872216
7     8  0.536620
8    56  0.253029
9    81  0.298577
10   32  0.431191
11   75  0.908531
12   31  0.619660
13   73  0.481040
14   20  0.029053
15   47  0.068355
16   50  0.324246
17   53  0.369011
18   62  0.172744
19   74  0.687350

In [29]:
pip install faker

Requirement already satisfied: faker in /Users/mehdihatamigoloujeh/opt/anaconda3/lib/python3.9/site-packages (14.2.0)
Requirement already satisfied: python-dateutil>=2.4 in /Users/mehdihatamigoloujeh/opt/anaconda3/lib/python3.9/site-packages (from faker) (2.8.2)
Requirement already satisfied: six>=1.5 in /Users/mehdihatamigoloujeh/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.4->faker) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [33]:
from faker import Faker

In [34]:
fake = Faker('fa')

In [35]:
fake.name()

'سرکار خانم دکتر بهار الوندی'

In [58]:
fake.name()

'سرکار خانم نازنين رستمی'

In [73]:
a = {
    'names':pd.Series([fake.name() for i in range(10)]),
    'IDnumber':pd.Series(np.random.randint(100,200, 10))
}

In [74]:
pd.DataFrame(a)

                        names  IDnumber
0               پرنيا حریریان       115
1  جناب آقای دکتر محمد تنزیلی       161
2                دانيال نامور       161
3               امیررضا کابلی       140
4      سرکار خانم مبينا کمالی       164
5             اميرعباس روحانی       195
6                ایلیا تحسینی       103
7             امیرمحمد چنگیزی       156
8                 آرمین دادفر       182
9             محمدرضا علیجانی       145

In [62]:
a = 2

In [67]:
[fake.name() for i in range(10)]

['محمدپارسا جعفر پور',
 'رضا رسولی',
 'سرکار خانم دکتر نازنين قاضی',
 'مبینا حسنی',
 'محمدمهدي یزدی',
 'سرکار خانم دکتر مهدیس جنتی',
 'ماهان مجتهدی',
 'یلدا کمالی',
 'سرکار خانم دکتر فاطمياسارينا وثاق',
 'محمدياسين چنگیزی']

In [60]:
import numpy as np

In [61]:
import pandas as pd

In [62]:
from faker import Faker

In [63]:
fake = Faker()

In [66]:
fake.name()

'Scott Boyd'

In [67]:
fake

In [68]:
S1 = [fake.name() for i in range(20)]

In [69]:
S1

['Nicholas Davis',
 'Alyssa Marshall',
 'Christian Potts',
 'Angela Mcclure',
 'Debra Russell',
 'Laurie Smith',
 'Daniel Thompson',
 'Michael Morris',
 'Walter Ray',
 'Ronnie Martin',
 'Edward Davis',
 'Stephen Allen',
 'Karen Dean',
 'Megan Diaz',
 'Laura Sanchez',
 'Dalton Brown',
 'Mr. Richard Munoz PhD',
 'Gregg Roberts',
 'Alexandra Serrano',
 'Jennifer White']

In [72]:
SS1 = pd.Series(S1, name="names")

In [73]:
SS1

0            Nicholas Davis
1           Alyssa Marshall
2           Christian Potts
3            Angela Mcclure
4             Debra Russell
5              Laurie Smith
6           Daniel Thompson
7            Michael Morris
8                Walter Ray
9             Ronnie Martin
10             Edward Davis
11            Stephen Allen
12               Karen Dean
13               Megan Diaz
14            Laura Sanchez
15             Dalton Brown
16    Mr. Richard Munoz PhD
17            Gregg Roberts
18        Alexandra Serrano
19           Jennifer White
Name: names, dtype: object

In [75]:
d = {
    'name': SS1,
    'age' : np.random.randint(90, size=20)
}

In [76]:
df = pd.DataFrame(d)

In [86]:
df

                     name  age
0          Nicholas Davis   65
1         Alyssa Marshall   23
2         Christian Potts   24
3          Angela Mcclure   85
4           Debra Russell   58
5            Laurie Smith   66
6         Daniel Thompson   40
7          Michael Morris   37
8              Walter Ray   78
9           Ronnie Martin   63
10           Edward Davis   72
11          Stephen Allen   58
12             Karen Dean   21
13             Megan Diaz   46
14          Laura Sanchez   53
15           Dalton Brown   56
16  Mr. Richard Munoz PhD   71
17          Gregg Roberts   24
18      Alexandra Serrano   69
19         Jennifer White   31

In [92]:
pd.DataFrame(df,index = [i for i in range(5)
                        ], columns=["name", "age"])

              name  age
0   Nicholas Davis   65
1  Alyssa Marshall   23
2  Christian Potts   24
3   Angela Mcclure   85
4    Debra Russell   58

In [93]:
df.columns

Index(['name', 'age'], dtype='object')

In [94]:
a = np.array(range(10))

In [95]:
a

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [96]:
s = pd.Series(a)

In [97]:
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [98]:
s[3] = 999

In [99]:
a

array([  0,   1,   2, 999,   4,   5,   6,   7,   8,   9])

In [100]:
s = pd.Series(a, copy=True)

In [101]:
s

0      0
1      1
2      2
3    999
4      4
5      5
6      6
7      7
8      8
9      9
dtype: int64

In [102]:
s[2] = 888

In [103]:
s

0      0
1      1
2    888
3    999
4      4
5      5
6      6
7      7
8      8
9      9
dtype: int64

In [104]:
a

array([  0,   1,   2, 999,   4,   5,   6,   7,   8,   9])

In [105]:
df

                     name  age
0          Nicholas Davis   65
1         Alyssa Marshall   23
2         Christian Potts   24
3          Angela Mcclure   85
4           Debra Russell   58
5            Laurie Smith   66
6         Daniel Thompson   40
7          Michael Morris   37
8              Walter Ray   78
9           Ronnie Martin   63
10           Edward Davis   72
11          Stephen Allen   58
12             Karen Dean   21
13             Megan Diaz   46
14          Laura Sanchez   53
15           Dalton Brown   56
16  Mr. Richard Munoz PhD   71
17          Gregg Roberts   24
18      Alexandra Serrano   69
19         Jennifer White   31

In [106]:
df["id"] = np.random.randint(1000, 1100, size= 20)

In [111]:
df.head()

              name  age    id
0   Nicholas Davis   65  1033
1  Alyssa Marshall   23  1034
2  Christian Potts   24  1088
3   Angela Mcclure   85  1084
4    Debra Russell   58  1090

In [122]:
a = pd.DataFrame(df,('fname', 'lname')=['name'].split())

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (909537860.py, line 1)

In [127]:
df.head()

              name  age    id
0   Nicholas Davis   65  1033
1  Alyssa Marshall   23  1034
2  Christian Potts   24  1088
3   Angela Mcclure   85  1084
4    Debra Russell   58  1090

In [129]:
df

                     name  age    id
0          Nicholas Davis   65  1033
1         Alyssa Marshall   23  1034
2         Christian Potts   24  1088
3          Angela Mcclure   85  1084
4           Debra Russell   58  1090
5            Laurie Smith   66  1014
6         Daniel Thompson   40  1049
7          Michael Morris   37  1049
8              Walter Ray   78  1087
9           Ronnie Martin   63  1066
10           Edward Davis   72  1098
11          Stephen Allen   58  1035
12             Karen Dean   21  1005
13             Megan Diaz   46  1064
14          Laura Sanchez   53  1028
15           Dalton Brown   56  1094
16  Mr. Richard Munoz PhD   71  1012
17          Gregg Roberts   24  1055
18      Alexandra Serrano   69  1020
19         Jennifer White   31  1028

In [130]:
df["old"] = df["age"] > 60

In [133]:
df[df["old"]]

                     name  age    id   old
0          Nicholas Davis   65  1033  True
3          Angela Mcclure   85  1084  True
5            Laurie Smith   66  1014  True
8              Walter Ray   78  1087  True
9           Ronnie Martin   63  1066  True
10           Edward Davis   72  1098  True
16  Mr. Richard Munoz PhD   71  1012  True
18      Alexandra Serrano   69  1020  True

In [135]:
df1 = pd.DataFrame(df, columns=["name"])

In [137]:
df1.squeeze()

0            Nicholas Davis
1           Alyssa Marshall
2           Christian Potts
3            Angela Mcclure
4             Debra Russell
5              Laurie Smith
6           Daniel Thompson
7            Michael Morris
8                Walter Ray
9             Ronnie Martin
10             Edward Davis
11            Stephen Allen
12               Karen Dean
13               Megan Diaz
14            Laura Sanchez
15             Dalton Brown
16    Mr. Richard Munoz PhD
17            Gregg Roberts
18        Alexandra Serrano
19           Jennifer White
Name: name, dtype: object

In [138]:

serie1 = df1.squeeze()

In [143]:
type(df1)

pandas.core.frame.DataFrame

In [144]:
df

                     name  age    id    old
0          Nicholas Davis   65  1033   True
1         Alyssa Marshall   23  1034  False
2         Christian Potts   24  1088  False
3          Angela Mcclure   85  1084   True
4           Debra Russell   58  1090  False
5            Laurie Smith   66  1014   True
6         Daniel Thompson   40  1049  False
7          Michael Morris   37  1049  False
8              Walter Ray   78  1087   True
9           Ronnie Martin   63  1066   True
10           Edward Davis   72  1098   True
11          Stephen Allen   58  1035  False
12             Karen Dean   21  1005  False
13             Megan Diaz   46  1064  False
14          Laura Sanchez   53  1028  False
15           Dalton Brown   56  1094  False
16  Mr. Richard Munoz PhD   71  1012   True
17          Gregg Roberts   24  1055  False
18      Alexandra Serrano   69  1020   True
19         Jennifer White   31  1028  False

In [145]:

del df["old"]

In [149]:
df["fname"] = df["name"].apply(lambda n:n.split()[0])
df["lname"] = df["name"].apply(lambda n:n.split()[1])

In [151]:
df.head()

              name  age    id      email      fname     lname
0   Nicholas Davis   65  1033   Nicholas   Nicholas     Davis
1  Alyssa Marshall   23  1034     Alyssa     Alyssa  Marshall
2  Christian Potts   24  1088  Christian  Christian     Potts
3   Angela Mcclure   85  1084     Angela     Angela   Mcclure
4    Debra Russell   58  1090      Debra      Debra   Russell

In [160]:
df["email"] = df["fname"]+df["lname"]+df["id"].apply(str)+"@mail.com"

In [162]:
df.head()

,name,age,id,email,fname,lname
0,Nicholas Davis,65,1033,NicholasDavis1033@mail.com,Nicholas,Davis
1,Alyssa Marshall,23,1034,AlyssaMarshall1034@mail.com,Alyssa,Marshall
2,Christian Potts,24,1088,ChristianPotts1088@mail.com,Christian,Potts
3,Angela Mcclure,85,1084,AngelaMcclure1084@mail.com,Angela,Mcclure
4,Debra Russell,58,1090,DebraRussell1090@mail.com,Debra,Russell

In [163]:
df.tail()

,name,age,id,email,fname,lname
15,Dalton Brown,56,1094,DaltonBrown1094@mail.com,Dalton,Brown
16,Mr. Richard Munoz PhD,71,1012,Mr.Richard1012@mail.com,Mr.,Richard
17,Gregg Roberts,24,1055,GreggRoberts1055@mail.com,Gregg,Roberts
18,Alexandra Serrano,69,1020,AlexandraSerrano1020@mail.com,Alexandra,Serrano
19,Jennifer White,31,1028,JenniferWhite1028@mail.com,Jennifer,White

In [166]:
df.to_csv('mydf.csv')

In [169]:
df = pd.read_csv('mydf.csv')

In [170]:
df

,Unnamed: 0,name,age,id,email,fname,lname
0,0,Nicholas Davis,65,1033,NicholasDavis1033@mail.com,Nicholas,Davis
1,1,Alyssa Marshall,23,1034,AlyssaMarshall1034@mail.com,Alyssa,Marshall
2,2,Christian Potts,24,1088,ChristianPotts1088@mail.com,Christian,Potts
3,3,Angela Mcclure,85,1084,AngelaMcclure1084@mail.com,Angela,Mcclure
4,4,Debra Russell,58,1090,DebraRussell1090@mail.com,Debra,Russell
5,5,Laurie Smith,66,1014,LaurieSmith1014@mail.com,Laurie,Smith
6,6,Daniel Thompson,40,1049,DanielThompson1049@mail.com,Daniel,Thompson
7,7,Michael Morris,37,1049,MichaelMorris1049@mail.com,Michael,Morris
8,8,Walter Ray,78,1087,WalterRay1087@mail.com,Walter,Ray
9,9,Ronnie Martin,63,1066,RonnieMartin1066@mail.com,Ronnie,Martin
10,10,Edward Davis,72,1098,EdwardDavis1098@mail.com,Edward,Davis
11,11,Stephen Allen,58,1035,StephenAllen1035@mail.com,Stephen,Allen
12,12,Karen Dean,21,1005,KarenDean1005@mail.com,Karen,Dean
13,13,Megan Diaz,46,1064,MeganDiaz1064@mail.com,Megan,Diaz
14,14,Laura Sanchez,53,1028,LauraSanchez1028@mail.com,Laura,Sanchez
15,15,Dalton Brown,56,1094,DaltonBrown1094@mail.com,Dalton,Brown
16,16,Mr. Richard Munoz PhD,71,1012,Mr.Richard1012@mail.com,Mr.,Richard
17,17,Gregg Roberts,24,1055,GreggRoberts1055@mail.com,Gregg,Roberts
18,18,Alexandra Serrano,69,1020,AlexandraSerrano1020@mail.com,Alexandra,Serrano
19,19,Jennifer White,31,1028,JenniferWhite1028@mail.com,Jennifer,White

In [174]:
del df['Unnamed: 0']

In [175]:
df

,name,age,id,email,fname,lname
0,Nicholas Davis,65,1033,NicholasDavis1033@mail.com,Nicholas,Davis
1,Alyssa Marshall,23,1034,AlyssaMarshall1034@mail.com,Alyssa,Marshall
2,Christian Potts,24,1088,ChristianPotts1088@mail.com,Christian,Potts
3,Angela Mcclure,85,1084,AngelaMcclure1084@mail.com,Angela,Mcclure
4,Debra Russell,58,1090,DebraRussell1090@mail.com,Debra,Russell
5,Laurie Smith,66,1014,LaurieSmith1014@mail.com,Laurie,Smith
6,Daniel Thompson,40,1049,DanielThompson1049@mail.com,Daniel,Thompson
7,Michael Morris,37,1049,MichaelMorris1049@mail.com,Michael,Morris
8,Walter Ray,78,1087,WalterRay1087@mail.com,Walter,Ray
9,Ronnie Martin,63,1066,RonnieMartin1066@mail.com,Ronnie,Martin
10,Edward Davis,72,1098,EdwardDavis1098@mail.com,Edward,Davis
11,Stephen Allen,58,1035,StephenAllen1035@mail.com,Stephen,Allen
12,Karen Dean,21,1005,KarenDean1005@mail.com,Karen,Dean
13,Megan Diaz,46,1064,MeganDiaz1064@mail.com,Megan,Diaz
14,Laura Sanchez,53,1028,LauraSanchez1028@mail.com,Laura,Sanchez
15,Dalton Brown,56,1094,DaltonBrown1094@mail.com,Dalton,Brown
16,Mr. Richard Munoz PhD,71,1012,Mr.Richard1012@mail.com,Mr.,Richard
17,Gregg Roberts,24,1055,GreggRoberts1055@mail.com,Gregg,Roberts
18,Alexandra Serrano,69,1020,AlexandraSerrano1020@mail.com,Alexandra,Serrano
19,Jennifer White,31,1028,JenniferWhite1028@mail.com,Jennifer,White

In [176]:
newdf = df.assign(newcolumn=5)

In [177]:
newdf

,name,age,id,email,fname,lname,newcolumn
0,Nicholas Davis,65,1033,NicholasDavis1033@mail.com,Nicholas,Davis,5
1,Alyssa Marshall,23,1034,AlyssaMarshall1034@mail.com,Alyssa,Marshall,5
2,Christian Potts,24,1088,ChristianPotts1088@mail.com,Christian,Potts,5
3,Angela Mcclure,85,1084,AngelaMcclure1084@mail.com,Angela,Mcclure,5
4,Debra Russell,58,1090,DebraRussell1090@mail.com,Debra,Russell,5
5,Laurie Smith,66,1014,LaurieSmith1014@mail.com,Laurie,Smith,5
6,Daniel Thompson,40,1049,DanielThompson1049@mail.com,Daniel,Thompson,5
7,Michael Morris,37,1049,MichaelMorris1049@mail.com,Michael,Morris,5
8,Walter Ray,78,1087,WalterRay1087@mail.com,Walter,Ray,5
9,Ronnie Martin,63,1066,RonnieMartin1066@mail.com,Ronnie,Martin,5
10,Edward Davis,72,1098,EdwardDavis1098@mail.com,Edward,Davis,5
11,Stephen Allen,58,1035,StephenAllen1035@mail.com,Stephen,Allen,5
12,Karen Dean,21,1005,KarenDean1005@mail.com,Karen,Dean,5
13,Megan Diaz,46,1064,MeganDiaz1064@mail.com,Megan,Diaz,5
14,Laura Sanchez,53,1028,LauraSanchez1028@mail.com,Laura,Sanchez,5
15,Dalton Brown,56,1094,DaltonBrown1094@mail.com,Dalton,Brown,5
16,Mr. Richard Munoz PhD,71,1012,Mr.Richard1012@mail.com,Mr.,Richard,5
17,Gregg Roberts,24,1055,GreggRoberts1055@mail.com,Gregg,Roberts,5
18,Alexandra Serrano,69,1020,AlexandraSerrano1020@mail.com,Alexandra,Serrano,5
19,Jennifer White,31,1028,JenniferWhite1028@mail.com,Jennifer,White,5

In [178]:
df

,name,age,id,email,fname,lname
0,Nicholas Davis,65,1033,NicholasDavis1033@mail.com,Nicholas,Davis
1,Alyssa Marshall,23,1034,AlyssaMarshall1034@mail.com,Alyssa,Marshall
2,Christian Potts,24,1088,ChristianPotts1088@mail.com,Christian,Potts
3,Angela Mcclure,85,1084,AngelaMcclure1084@mail.com,Angela,Mcclure
4,Debra Russell,58,1090,DebraRussell1090@mail.com,Debra,Russell
5,Laurie Smith,66,1014,LaurieSmith1014@mail.com,Laurie,Smith
6,Daniel Thompson,40,1049,DanielThompson1049@mail.com,Daniel,Thompson
7,Michael Morris,37,1049,MichaelMorris1049@mail.com,Michael,Morris
8,Walter Ray,78,1087,WalterRay1087@mail.com,Walter,Ray
9,Ronnie Martin,63,1066,RonnieMartin1066@mail.com,Ronnie,Martin
10,Edward Davis,72,1098,EdwardDavis1098@mail.com,Edward,Davis
11,Stephen Allen,58,1035,StephenAllen1035@mail.com,Stephen,Allen
12,Karen Dean,21,1005,KarenDean1005@mail.com,Karen,Dean
13,Megan Diaz,46,1064,MeganDiaz1064@mail.com,Megan,Diaz
14,Laura Sanchez,53,1028,LauraSanchez1028@mail.com,Laura,Sanchez
15,Dalton Brown,56,1094,DaltonBrown1094@mail.com,Dalton,Brown
16,Mr. Richard Munoz PhD,71,1012,Mr.Richard1012@mail.com,Mr.,Richard
17,Gregg Roberts,24,1055,GreggRoberts1055@mail.com,Gregg,Roberts
18,Alexandra Serrano,69,1020,AlexandraSerrano1020@mail.com,Alexandra,Serrano
19,Jennifer White,31,1028,JenniferWhite1028@mail.com,Jennifer,White